K6-Tests/resultados/epica2-volume-phase0-inicial.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: epica2-volume.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 3m30s max duration (incl. graceful stop):
              * default: 10 looping VUs for 3m0s (gracefulStop: 30s)

time="2026-03-02T16:56:46-03:00" level=info msg="Registrar el volumen actual: SELECT COUNT(*) FROM loans; SELECT COUNT(*) FROM kardex;" source=console

running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 10 VUs  0m00.5s/3m0s

running (0m02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m01.5s/3m0s

running (0m03.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 10 VUs  0m02.5s/3m0s

running (0m04.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m03.5s/3m0s

running (0m05.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 10 VUs  0m04.5s/3m0s

running (0m06.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  0m05.5s/3m0s

running (0m07.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m06.5s/3m0s

running (0m08.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   4% ] 10 VUs  0m07.5s/3m0s

running (0m09.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m08.5s/3m0s

running (0m10.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   5% ] 10 VUs  0m09.5s/3m0s

running (0m11.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m10.5s/3m0s

running (0m12.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   6% ] 10 VUs  0m11.5s/3m0s

running (0m13.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m12.5s/3m0s

running (0m14.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  0m13.5s/3m0s

running (0m15.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   8% ] 10 VUs  0m14.5s/3m0s

running (0m16.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m15.5s/3m0s

running (0m17.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [   9% ] 10 VUs  0m16.5s/3m0s

running (0m18.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m17.5s/3m0s

running (0m19.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  0m18.5s/3m0s

running (0m20.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m19.5s/3m0s

running (0m21.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  11% ] 10 VUs  0m20.5s/3m0s

running (0m22.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m21.5s/3m0s

running (0m23.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  12% ] 10 VUs  0m22.5s/3m0s

running (0m24.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  0m23.5s/3m0s

running (0m25.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m24.5s/3m0s

running (0m26.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  14% ] 10 VUs  0m25.5s/3m0s

running (0m27.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m26.5s/3m0s

running (0m28.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  15% ] 10 VUs  0m27.5s/3m0s

running (0m29.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m28.5s/3m0s

running (0m30.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  16% ] 10 VUs  0m29.5s/3m0s

running (0m31.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m30.5s/3m0s

running (0m32.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  0m31.5s/3m0s

running (0m33.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  18% ] 10 VUs  0m32.5s/3m0s

running (0m34.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m33.5s/3m0s

running (0m35.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  19% ] 10 VUs  0m34.5s/3m0s

running (0m36.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m35.5s/3m0s

running (0m37.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  0m36.5s/3m0s

running (0m38.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m37.5s/3m0s

running (0m39.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  21% ] 10 VUs  0m38.5s/3m0s

running (0m40.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m39.5s/3m0s

running (0m41.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  22% ] 10 VUs  0m40.5s/3m0s

running (0m42.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  0m41.5s/3m0s

running (0m43.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  0m42.5s/3m0s

running (0m44.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  24% ] 10 VUs  0m43.5s/3m0s

running (0m45.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m44.5s/3m0s

running (0m46.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  25% ] 10 VUs  0m45.5s/3m0s

running (0m47.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m46.5s/3m0s

running (0m48.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  26% ] 10 VUs  0m47.5s/3m0s

running (0m49.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m48.5s/3m0s

running (0m50.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  0m49.5s/3m0s

running (0m51.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  28% ] 10 VUs  0m50.5s/3m0s

running (0m52.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  0m51.5s/3m0s

running (0m53.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  29% ] 10 VUs  0m52.5s/3m0s

running (0m54.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m53.5s/3m0s

running (0m55.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  0m54.5s/3m0s

running (0m56.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m55.5s/3m0s

running (0m57.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  31% ] 10 VUs  0m56.5s/3m0s

running (0m58.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m57.5s/3m0s

running (0m59.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  32% ] 10 VUs  0m58.5s/3m0s

running (1m00.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  0m59.5s/3m0s

running (1m01.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m00.5s/3m0s

running (1m02.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  34% ] 10 VUs  1m01.5s/3m0s

running (1m03.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m02.5s/3m0s

running (1m04.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  35% ] 10 VUs  1m03.5s/3m0s

running (1m05.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m04.5s/3m0s

running (1m06.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  36% ] 10 VUs  1m05.5s/3m0s

running (1m07.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m06.5s/3m0s

running (1m08.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  1m07.5s/3m0s

running (1m09.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  38% ] 10 VUs  1m08.5s/3m0s

running (1m10.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m09.5s/3m0s

running (1m11.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  39% ] 10 VUs  1m10.5s/3m0s

running (1m12.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  1m11.5s/3m0s

running (1m13.0s), 10/10 VUs, 132 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  1m12.5s/3m0s

running (1m14.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  1m13.5s/3m0s

running (1m15.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  41% ] 10 VUs  1m14.5s/3m0s

running (1m16.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  1m15.5s/3m0s

running (1m17.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  42% ] 10 VUs  1m16.5s/3m0s

running (1m18.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  1m17.5s/3m0s

running (1m19.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  1m18.5s/3m0s

running (1m20.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  44% ] 10 VUs  1m19.5s/3m0s

running (1m21.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  1m20.5s/3m0s

running (1m22.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  45% ] 10 VUs  1m21.5s/3m0s

running (1m23.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  1m22.5s/3m0s

running (1m24.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  46% ] 10 VUs  1m23.5s/3m0s

running (1m25.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  1m24.5s/3m0s

running (1m26.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  1m25.5s/3m0s

running (1m27.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  48% ] 10 VUs  1m26.5s/3m0s

running (1m28.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  1m27.5s/3m0s

running (1m29.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  49% ] 10 VUs  1m28.5s/3m0s

running (1m30.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  1m29.5s/3m0s

running (1m31.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  1m30.5s/3m0s

running (1m32.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  1m31.5s/3m0s

running (1m33.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  51% ] 10 VUs  1m32.5s/3m0s

running (1m34.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  1m33.5s/3m0s

running (1m35.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  52% ] 10 VUs  1m34.5s/3m0s

running (1m36.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  1m35.5s/3m0s

running (1m37.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  1m36.5s/3m0s

running (1m38.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  54% ] 10 VUs  1m37.5s/3m0s

running (1m39.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  1m38.5s/3m0s

running (1m40.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  55% ] 10 VUs  1m39.5s/3m0s

running (1m41.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  1m40.5s/3m0s

running (1m42.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  56% ] 10 VUs  1m41.5s/3m0s

running (1m43.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  1m42.5s/3m0s

running (1m44.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  1m43.5s/3m0s

running (1m45.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  58% ] 10 VUs  1m44.5s/3m0s

running (1m46.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  1m45.5s/3m0s

running (1m47.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  59% ] 10 VUs  1m46.5s/3m0s

running (1m48.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  1m47.5s/3m0s

running (1m49.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  1m48.5s/3m0s

running (1m50.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  1m49.5s/3m0s

running (1m51.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  61% ] 10 VUs  1m50.5s/3m0s

running (1m52.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  1m51.5s/3m0s

running (1m53.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  62% ] 10 VUs  1m52.5s/3m0s

running (1m54.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  1m53.5s/3m0s

running (1m55.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  1m54.5s/3m0s

running (1m56.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  64% ] 10 VUs  1m55.5s/3m0s

running (1m57.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  1m56.5s/3m0s

running (1m58.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  65% ] 10 VUs  1m57.5s/3m0s

running (1m59.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  1m58.5s/3m0s

running (2m00.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  66% ] 10 VUs  1m59.5s/3m0s

running (2m01.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  2m00.5s/3m0s

running (2m02.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  2m01.5s/3m0s

running (2m03.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  68% ] 10 VUs  2m02.5s/3m0s

running (2m04.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  2m03.5s/3m0s

running (2m05.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  69% ] 10 VUs  2m04.5s/3m0s

running (2m06.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  2m05.5s/3m0s

running (2m07.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  2m06.5s/3m0s

running (2m08.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  2m07.5s/3m0s

running (2m09.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  71% ] 10 VUs  2m08.5s/3m0s

running (2m10.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  2m09.5s/3m0s

running (2m11.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  72% ] 10 VUs  2m10.5s/3m0s

running (2m12.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  2m11.5s/3m0s

running (2m13.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  2m12.5s/3m0s

running (2m14.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  74% ] 10 VUs  2m13.5s/3m0s

running (2m15.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  2m14.5s/3m0s

running (2m16.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  75% ] 10 VUs  2m15.5s/3m0s

running (2m17.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  2m16.5s/3m0s

running (2m18.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [  76% ] 10 VUs  2m17.5s/3m0s

running (2m19.0s), 10/10 VUs, 261 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  2m18.5s/3m0s

running (2m20.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  2m19.5s/3m0s

running (2m21.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  78% ] 10 VUs  2m20.5s/3m0s

running (2m22.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  2m21.5s/3m0s

running (2m23.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  79% ] 10 VUs  2m22.5s/3m0s

running (2m24.0s), 10/10 VUs, 270 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  2m23.5s/3m0s

running (2m25.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  2m24.5s/3m0s

running (2m26.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  2m25.5s/3m0s

running (2m27.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  81% ] 10 VUs  2m26.5s/3m0s

running (2m28.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  2m27.5s/3m0s

running (2m29.0s), 10/10 VUs, 280 complete and 0 interrupted iterations
default   [  82% ] 10 VUs  2m28.5s/3m0s

running (2m30.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  2m29.5s/3m0s

running (2m31.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  2m30.5s/3m0s

running (2m32.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [  84% ] 10 VUs  2m31.5s/3m0s

running (2m33.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  2m32.5s/3m0s

running (2m34.0s), 10/10 VUs, 290 complete and 0 interrupted iterations
default   [  85% ] 10 VUs  2m33.5s/3m0s

running (2m35.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  2m34.5s/3m0s

running (2m36.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
default   [  86% ] 10 VUs  2m35.5s/3m0s

running (2m37.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  2m36.5s/3m0s

running (2m38.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  2m37.5s/3m0s

running (2m39.0s), 10/10 VUs, 300 complete and 0 interrupted iterations
default   [  88% ] 10 VUs  2m38.5s/3m0s

running (2m40.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  2m39.5s/3m0s

running (2m41.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
default   [  89% ] 10 VUs  2m40.5s/3m0s

running (2m42.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  2m41.5s/3m0s

running (2m43.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  2m42.5s/3m0s

running (2m44.0s), 10/10 VUs, 310 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  2m43.5s/3m0s

running (2m45.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  91% ] 10 VUs  2m44.5s/3m0s

running (2m46.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  2m45.5s/3m0s

running (2m47.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  92% ] 10 VUs  2m46.5s/3m0s

running (2m48.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  2m47.5s/3m0s

running (2m49.0s), 10/10 VUs, 320 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  2m48.5s/3m0s

running (2m50.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  94% ] 10 VUs  2m49.5s/3m0s

running (2m51.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  2m50.5s/3m0s

running (2m52.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  95% ] 10 VUs  2m51.5s/3m0s

running (2m53.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  2m52.5s/3m0s

running (2m54.0s), 10/10 VUs, 330 complete and 0 interrupted iterations
default   [  96% ] 10 VUs  2m53.5s/3m0s

running (2m55.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  2m54.5s/3m0s

running (2m56.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  2m55.5s/3m0s

running (2m57.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  98% ] 10 VUs  2m56.5s/3m0s

running (2m58.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  2m57.5s/3m0s

running (2m59.0s), 10/10 VUs, 340 complete and 0 interrupted iterations
default   [  99% ] 10 VUs  2m58.5s/3m0s

running (3m00.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  2m59.5s/3m0s

running (3m01.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  3m0s

running (3m02.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  3m0s

running (3m03.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  3m0s

running (3m04.0s), 10/10 VUs, 350 complete and 0 interrupted iterations
default ↓ [ 100% ] 10 VUs  3m0s


  █ THRESHOLDS 

    failed_requests
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(95)<5000' p(95)=42.75ms

    paginated_query_duration
    ✓ 'p(95)<5000' p(95)=35.71ms


  █ TOTAL RESULTS 

    checks_total.......: 2160    11.694348/s
    checks_succeeded...: 100.00% 2160 out of 2160
    checks_failed......: 0.00%   0 out of 2160

    ✓ paginated p.0 → 200
    ✓ paginated p.10 → 200
    ✓ filter ACTIVO → 200
    ✓ filter FINALIZED → 200
    ✓ loan/user paginated → 200
    ✓ GET /kardex/paginated → 200

    CUSTOM
    failed_requests................: 0.00%  0 out of 2160
    filter_query_duration..........: avg=17.25ms min=2.96ms med=12.3ms  max=122.69ms p(90)=31.6ms  p(95)=46.36ms
    kardex_query_duration..........: avg=19.51ms min=3.09ms med=14.29ms max=108.36ms p(90)=37.19ms p(95)=46.51ms
    paginated_query_duration.......: avg=19.83ms min=3.45ms med=12.58ms max=372.87ms p(90)=26.34ms p(95)=35.71ms
    user_loans_query_duration......: avg=15.67ms min=3.84ms med=12.46ms max=82ms     p(90)=26.07ms p(95)=37.39ms

    HTTP
    http_req_duration..............: avg=18.43ms min=2.96ms med=12.72ms max=473.07ms p(90)=29.48ms p(95)=42.75ms
      { expected_response:true }...: avg=18.43ms min=2.96ms med=12.72ms max=473.07ms p(90)=29.48ms p(95)=42.75ms
    http_req_failed................: 0.00%  0 out of 2161
    http_reqs......................: 2161   11.699762/s

    EXECUTION
    iteration_duration.............: avg=5.11s   min=5.04s  med=5.08s   max=5.78s    p(90)=5.15s   p(95)=5.2s   
    iterations.....................: 360    1.949058/s
    vus............................: 10     min=10        max=10
    vus_max........................: 10     min=10        max=10

    NETWORK
    data_received..................: 3.1 MB 17 kB/s
    data_sent......................: 135 kB 730 B/s



running (3m04.7s), 00/10 VUs, 360 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  3m0s